Revit 2026 API

# ElectricalDemandFactorValue Methods

---

The ElectricalDemandFactorValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetMaxRangeToUnlimited | Sets the max range on the value to unlimited |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ElectricalDemandFactorValue Class

Autodesk.Revit.DB.Electrical Namespace